{
  "template": {
    "title": "",
    "description": "",
    "interpretation": "",
    "risk": "",
    "poa": ""
  },
  "computer_admin": {
    "description": "List of computers admin of other machines.",
    "risk": "This controls reveals computers (i.e., the computer machine account) that have local administration privileges over other computers. This weakness can be leveraged by any domain user to relay coerced connections and eventually obtain local administration privileges over target computer. Coerced authentication can be triggered using numerous techniques such as EFSRPC (e.g., using PetitPotam). This attack requires network access over target machine and that SMB signing be not required (which is default).",
    "poa": "Microsoft's primary goal is not to mitigate coerced-authentication based attacks. Indeed, the general recommendation is to require SMB signing and also to ensure that unnecessarry relayable services (e.g., SMB, RPC, etc.) be filtered to users."
  },
  "domain_map_trust": {
    "description": "Visual map of the existing domains and their trust relationship.",
    "risk": "Unnecessary trusts between domain will at least provide visibility (e.g., capacity to enumerate domain objects in an attemps to determine attack path).",
    "poa": "Review existing trusts and make sure that these are justified for operations."
  },
  "nb_domain_admins": {
    "title": "High number of domain admins",
    "description": "These accounts are the most privileged and have unlimited access to the AD infrastructure.",
    "risk": "Domain admin accounts have unlimited access over the Active Directory infrastructure. Compromise of a domain account will provide attackers full access over the infrastructure. Such privileges should be stricly provided on a need-to-know basis.",
    "poa": "Make sure that domain admins shown here effectively need this level of privileges. Also, make sure that these accounts are used solely for activities that require domain administration (i.e., these accounts should not be used for daily routines and should never be used outside of domain controllers)"
  },
  "nb_domain_controllers": {
    "description": "Domain controllers are the central servers of AD and provide multiple services to support the AD infrastructure.",
    "interpretation": "This control is rather informational and is meant to point which computers act as domain controllers.",
    "risk": "N/A",
    "poa": "N/A"
  },
  "computers": {
    "description": "List of all computers on any domain.",
    "interpretation": "This control is rather informational and shall help confirming the current extent of the computer objects within the domain.",
    "risk": "N/A",
    "poa": "N/A"
  },
  "users": {
    "description": "List of all users on any domain",
    "risk": "N/A",
    "poa": "This control is rather informational and shall help getting a better understanding of the current objects."
  },
  "groups": {
    "description": "List of all groups on any domain",
    "risk": "N/A",
    "poa": "This control is rather informational and shall help getting a better understanding of the current objects."
  },
  "users_rdp_access": {
    "title": "RDP access (users)",
    "description": "Users who are allowed to access computers through Remote Desktop Protocol (RDP).",
    "risk": "With this privilege, a user can remotely spawn an graphical interactive session on a machine. RDP access allows attackers to pivot in the network.",
    "poa": "Review this list to ensure RDP access is legitimate."
  },
  "users_rdp_access_computers": {
    "title": "RDP access (users)",
    "description": "List of all computers which can be accessed by the chosen user through RDP.",
    "risk": "With this privilege, the user can remotely spawn an graphical interactive session on a machine. RDP access allows attackers to pivot in the network.",
    "poa": "Having a large number of users with RDP access is an indicator of inadequate privilege settings (often inherited from group memberships). Review this list to ensure RDP access is legitimate."
  },
  "computers_list_of_rdp_users": {
    "title": "RDP access (computers)",
    "description": "Computers which can be accessed with Remote Desktop Protocol (RDP).",
    "risk": "For each computer, the lower the number, the better. Overall, the total number of computers with RDP access should be as low as possible. RDP access allows attackers to pivot in the network.",
    "poa": "Review this list to ensure RDP access is legitimate on these machines."
  },
  "computers_list_of_rdp_users_list": {
    "description": "List of users with RDP access for a given computer.",
    "risk": "Ideally, this list should be reduced to the strict minimum. RDP access allows attackers to pivot in the network.",
    "poa": "Review this list to ensure RDP access is legitimate."
  },
  "_paths_to_ou_handlers": {
    "description": "Graph of paths leading to OU handlers",
    "risk": "Compromission paths to OU handlers represent the exposed attack surface that the AD environment presents to the attacker in order to gain corresponding privileges.",
    "poa": "Review the paths, make sure they are not exploitable. If they are, cut the link between the Active Directory objects in order to reduce the attack surface."
  },
  "laps_computer_list": {
    "description": "Microsoft Local Administrator Password Solution (LAPS) allows local admnistrators to manage different passwords on local administrator accounts.",
    "risk": "The more computers are configured with LAPS, the better, especially on critical servers/machines. Without LAPS, it becomes tedious to have different passwords on local administrator for different computers, resulting in reuse of passwords and a risk of lateral movement.",
    "poa": "LAPS is a good tool to use, consider installing it or expanding its usage to more computers."
  },
  "dom_admin_on_non_dc": {
    "title": "Domain admin logged on non-DC",
    "description": "Domain admins connected to non DC computers. If an attacker compromises any of these computers, he will instantly obtain domain administration privileges.",
    "risk": "Ideally, this page should be empty. Domain administrators connecting to computers leave credentials traces in memory, which could lead to a complete compromission of the Active Directory.",
    "poa": "If this page is not empty, modify the configuration so that no domain admins are connected to non DC computers."
  },
  "computers_admin_of_computers": {
    "title": "Computers admin of other computers",
    "description": "Some machine accounts have administration privileges over other computers accounts.",
    "risk": "This controls reveals computers (i.e., the computer machine account) that have local administration privileges over other computers. This weakness can be leveraged by any domain user to relay coerced connections and eventually obtain local administration privileges over target computer. Coerced authentication can be triggered using numerous techniques such as EFSRPC (e.g., using PetitPotam). This attack requires network access over target machine and that SMB signing be not required (which is default).",
    "poa": "Microsoft's primary goal is not to mitigate coerced-authentication based attacks. Indeed, the general recommendation is to require SMB signing and also to ensure that unnecessarry relayable services (e.g., SMB, RPC, etc.) be filtered to users."
  },
  "user_admin": {
    "description": "List of computers where the selected users have admin privileges.",
    "risk": "Users may have local administrative rights over some machines. This means that they can install software, change configuration, etc. If one of the users is compromised, then you can consider that all the machines the user is admin of are compromised too. The more accounts have admin privileges, the bigger the attack surface is. Ideally there should be as little accounts as possible with admin privileges.",
    "poa": "Review the accounts and make sure that they have admin privileges only on machines where they need it."
  },
  "computers_users_admin": {
    "description": "Number of admins on each computers.",
    "risk": "Too many admin accounts on a computer should be a red flag. As too many admins is often a sign of outdated configuration, it could be exploited to gain higher privilege.",
    "poa": "Review this list of computers, especially the ones with a high number of admin and limit the number of admins to a minimum."
  },
  "computer_administrable": {
    "description": "List of admin accounts for the selected computer.",
    "risk": "Users may have local administrative rights over some machines. This means that they can install software, change configuration, etc. If one of the users is compromised, then you can consider that all the machines the user is admin of are compromised too. The more accounts have admin privileges, the bigger the attack surface is. Ideally there should be as little accounts as possible with admin privileges.",
    "poa": "Review the accounts and make sure that they have admin privileges only on machines where they need it."
  },
  "computers_members_high_privilege": {
    "title": "Computers with high privilege",
    "description": "List of computers with high privileges.",
    "risk": "Ideally, this list should be reduced to the minimum required. If these machines are compromised by an attacker, they will provide them with the corresponding privileges, which could be very dangerous.",
    "poa": "Check for any anomaly in this list."
  },
  "can_dcsync": {
    "title": "Accounts with DCSync privileges",
    "description": "All these domain objects are granted DCSync privileges and can, as such, dump all data from Active Directory",
    "risk": "Only servers that require DCSync should have this privilege. A misconfiguration of DCSync privilege could result in the dump of all data in the AD (including, users and password hashes).",
    "poa": "Review this list and check for any anomaly."
  },
  "can_dcsync_graph": {
    "description": "List of paths to a dcsync account.",
    "risk": "These paths lead to accounts that have DCSync privileges. If one of these paths is exploited, the attacker will be able to dump all data from Active Directory (including users and machines password hashes). ",
    "poa": "Review the paths, make sure they are not exploitable. If they are, cut the link between the Active Directory objects in order to reduce the attack surface."
  },
  "graph_path_objects_to_da": {
    "title": "Compromission paths to domain admins",
    "description": "Compromission paths from some Active Directory object to domain admin privileges.",
    "risk": "Compromission paths to domain admin represent the exposed attack surface that the AD environment presents to the attacker in order to gain privileges in the domain(s). If an attacker exploits one of these paths, they will be able to gain privileges in the domain(s) and cause some serious damage.",
    "poa": "Review the paths, make sure they are not exploitable. If they are, cut the link between the Active Directory objects in order to reduce the attack surface."
  },
  "graph_path_objects_to_unconstrained_delegation": {
    "description": "Path to accounts that are allowed to connect to any service with the identity of another user who connected to them.",
    "risk": "These accounts can impersonate any domain and eventually lead to full compromise of the infrastructure. Optimally, this list should be empty as delegation should be set up with constrained delegation.",
    "poa": "Unless necessary, switch to constrained delegation for a safer infrastructure."
  },
  "non-dc_users_with_unconstrained_delegations": {
    "title": "Users with unconstrained delegations",
    "description": "These user accounts are allowed to connect to any service with the identity of another user who connected to them. It only concerns users that are not sensitive.",
    "risk": "These accounts can impersonate any domain and eventually lead to full compromise of the infrastructure. Optimally, this list should be empty as delegation should be set up with constrained delegation.",
    "poa": "Unless necessary, switch to constrained delegation for a safer infrastructure."
  },
  "graph_path_objects_to_unconstrained_delegation_users": {
    "description": "Path to user accounts that are allowed to connect to any service with the identity of another user who connected to them.",
    "risk": "These accounts can impersonate any domain and eventually lead to full compromise of the infrastructure. Optimally, this list should be empty as delegation should be set up with constrained delegation.",
    "poa": "Unless necessary, switch to constrained delegation for a safer infrastructure."
  },
  "main_compromise_paths": {
    "description": "This histogram shows the nodes that have the most compromise paths",
    "risk": "Paths with the most compromise paths are most at risk",
    "poa": "Securing these risky nodes can have a strong impact on compromise paths"
  },
  "users_GPO_access": {
    "title": "GPOs that can be edited by unprivileged users",
    "description": "GPOs that can be edited by unprivileged users.",
    "risk": "If an AD object has rights over a GPO, it can potentially cause damage over all the objects affected by the GPO. GPOs can also be leveraged to gain privileges in the domain(s). If an attacker exploits one of these paths, they will be able to gain privileges in the domain(s) and cause some serious damage.<br/><br/><i class='bi bi-star-fill' style='color: red'></i><i class='bi bi-star-fill' style='color: red'></i><i class='bi bi-star-fill' style='color: red'></i> : Full domain or at least one domain admin as target.<br /><i class='bi bi-star-fill' style='color: orange'></i><i class='bi bi-star-fill' style='color: orange'></i><i class='bi bi-star' style='color: orange'></i> : At least one object admin of a computer.<br/><i class='bi bi-star-fill' style='color: green'></i><i class='bi bi-star' style='color: green'></i><i class='bi bi-star' style='color: green'></i> : At least one object as target.<br/><i class='bi bi-star' style='color: green'></i><i class='bi bi-star' style='color: green'></i><i class='bi bi-star' style='color: green'></i> : No direct target.",
    "poa": "Review the paths, make sure they are not exploitable. If they are, cut the link between the Active Directory objects in order to reduce the attack surface."
  },
  "graph_GPO_access": {
    "description": "Graph of paths for GPO exploit",
    "interpretation": "",
    "risk": "If an AD object has rights over a GPO, it can potentially cause damage over all the objects affected by the GPO. GPOs can also be leveraged to gain privileges in the domain(s). If an attacker exploits one of these paths, they will be able to gain privileges in the domain(s) and cause some serious damage.",
    "poa": "Review the paths, make sure they are not exploitable. If they are, cut the link between the Active Directory objects in order to reduce the attack surface."
  },
  "grid_GPO_access": {
    "description": "Grid of paths for GPO exploit",
    "interpretation": "",
    "risk": "If an AD object has rights over a GPO, it can potentially cause damage over all the objects affected by the GPO. GPOs can also be leveraged to gain privileges in the domain(s). If an attacker exploits one of these paths, they will be able to gain privileges in the domain(s) and cause some serious damage.",
    "poa": "Review the objects in this list by making sure they are not wrongfully allowed to edit this GPO."
  },
  "paths_to_domain_admin": {
    "description": "Graph of paths leading to domain admin",
    "risk": "Compromission paths to domain admin represent the exposed attack surface that the AD environment presents to the attacker in order to gain privileges in the domain(s). If an attacker exploits one of these paths, they will be able to gain privileges in the domain(s) and cause some serious damage.",
    "poa": "Review the paths, make sure they are not exploitable. If they are, cut the link between the Active Directory objects in order to reduce the attack surface."
  },
  "paths_to_dcsync": {
    "description": "Graph of paths leading to dcsync",
    "risk": "These paths lead to accounts that have DCSync privileges. If one of these paths is exploited, the attacker will be able to dump all data from Active Directory (including users and machines password hashes). ",
    "poa": "Review the paths, make sure they are not exploitable. If they are, cut the link between the Active Directory objects in order to reduce the attack surface."
  },
  "compromission_paths": {
    "description": "Compromission paths are AD configurations that can be used by attackers to gain privileges in the domain(s) or cause some damage to the information system.",
    "risk": "Compromission paths represent the exposed attack surface that the AD environment presents to the attacker in order to gain privileges in the domain(s). If one of these paths is exploited, the attacker will be able to dump all data from Active Directory (including users and machines password hashes). ",
    "poa": "Review the paths, make sure they are not exploitable. If they are, cut the link between the Active Directory objects in order to reduce the attack surface."
  },
  "main_page": {
    "description": "Main dashboard of ADMiner",
    "interpretation": "This dashboard presents all the controls points of ADMiner, click on one of them to get more information.",
    "risk": "",
    "poa": ""
  },
  "objects_with_adminSDHolder": {
    "description": "AdminSDHolder protects certain domains objects from permission changes",
    "risk": "AdminSDHolder contains a list of permissions (ACLs) that are applied to the objects protected by the AdminSDHolder. As an example, AdminSDHolder can contain 'Authenticated Users : Read', meaning that all members of the 'Authenticated Users' group will be able to read the objects protected by the AdminSDHolder. Permissions described in the AdminSDHolder are applied to the objects every 60 minutes. AdminSDHolder is a way for attackers to persist in the domain. An attacker could for example add permissions for an object that they have already compromised, giving them privileges over the protected objects.",
    "poa": "There needs to be detection of changes on the AdminSDHolder AD object. Changes on the object are relatively rare and should therefore be monitored as indicators of compromise (IoCs)."
  },
  "domain_OUs": {
    "description": "Organisational Units of the domain",
    "interpretation": "",
    "risk": "",
    "poa": ""
  },
  "OU_member": {
    "description": "Members of the Organisational Units of the domain",
    "interpretation": "",
    "risk": "",
    "poa": ""
  },
  "users_to_computers": {
    "description": "Path of users who have direct or indirect administration privilege on computers",
    "interpretation": "",
    "risk": "Inadequate administration rights on computers can lead to easy privilege escalation for an attacker. With a privileged account, it is possible to perform local memory looting to find credentials for example.",
    "poa": "Only a handful of accounts should have administrator privilege on computers to perform some maintenance actions. No normal user should be admin of any computer, not even its own."
  },
  "server_users_could_be_admin": {
    "title": "Compromission paths to servers",
    "description": "Users could gain administration privileges privileges on some servers.",
    "interpretation": "",
    "risk": "Inadequate administration rights on computers can lead to easy privilege escalation for an attacker. With a privileged account, it is possible to perform local memory looting to find credentials for example.",
    "poa": "Only a handful of accounts should have administrator privilege on computers to perform some maintenance actions. No normal user should be admin of any computer, not even its own."
  },
  "unpriv_to_dnsadmins": {
    "title": "Users with path to DNS Admins",
    "description": "Users can take over DNS Admins group, leading to domain compromission.",
    "risk": "",
    "poa": ""
  },
  "graph_path_objects_to_ou_handlers": {
    "title": "Objects have paths to compromise OU handlers",
    "description": "Objects that have paths to compromise OU handlers.",
    "risk": "OUs that can be used to leverage access to privileged accounts or objects are particularly sensitive.",
    "poa": "Review the exploitation paths for these OUs and remove dangerous links."
  },
  "vuln_sidhistory_dangerous": {
    "title": "Objects have a SID history",
    "description": "Objects have a SID history",
    "interpretation": "",
    "risk": "",
    "poa": ""
  },
  "objects_to_operators_member": {
    "title": "Objects with path to an Operator Group",
    "description": "Objects with a compromission path to an Operator Group.",
    "risk": "As Oprator Groups have high privilege, a compromission path to one is a major threat to the security of the domain.",
    "poa": "Review all these paths and try to remove as many dangerous links as possible."
  },
  "vuln_permissions_adminsdholder": {
    "title": "Paths to the AdminSDHolder container",
    "description": "Paths to the AdminSDHolder container",
    "interpretation": "",
    "risk": "",
    "poa": ""
  },
  "adcs": {
    "title": "ADCS servers",
    "description": "ADCS (Active Directory Certificate Services) is a Windows Server feature that provides a customizable certification authority (CA) for issuing and managing digital certificates. Digital certificates are used to authenticate and secure communication between devices, servers, and users on a network.",
    "interpretation": "",
    "risk": "",
    "poa": ""
  },
  "da_to_da": {
    "title": "Paths from a domain to another as domain admin",
    "description": "From a domain admin group of a given domain, it shows the paths the domain admin groups of every other domains.",
    "risk": "If a path exists between two domains, it means that if the first domain is fully compromised, the second one can quickly be compromised as well. A malicious entity could use these paths to rapidly compromise all domains.",
    "poa": "Review the paths of compromission between domains and remove links if possible."
  },
  "path_to_adcs": {
    "title": "Paths to the AdminSDHolder container",
    "description": "Paths to the AdminSDHolder container",
    "risk": "This ADCS server can be compromised, which means that an attacker can issue fraudulent certificates, which can be used to impersonate legitimate users or servers on the network. This can lead to unauthorized access to sensitive information, data theft, or network disruption.",
    "poa": "Ensure that the existing privileges on this ADCS server are legitimate and limit them to administrators optimaly."
  },
  "dangerous_paths": {
    "title": "Main paths to become a domain administrator",
    "description": "List of the main paths to become a domain administrator",
    "risk": "This representation exposes the most common links to become domain administrator, which means the more likely to be used during an attack.",
    "poa": "Tackling the most common paths is a good approach to limit the risk of a compromission as it removes most of the paths to domain administrator."
  },
  "anomaly_acl": {
    "title": "Anomaly ACL",
    "description": "An ACL (Access Control List) is a security mechanism that defines permissions and access rights for objects within the Active Directory structure.",
    "risk": "Misconfigured ACL can create access points or privilege escalation that an attacker could use to compromise the domain.<br /><br /><i class='bi bi-star-fill'></i><i class='bi bi-star-fill'></i><i class='bi bi-star-fill'></i> : At least one domain admin as target<br /><i class='bi bi-star-fill'></i><i class='bi bi-star-fill'></i><i class='bi bi-star'></i> : At least one object has a path to domain admin<br /><i class='bi bi-star-fill'></i><i class='bi bi-star'></i><i class='bi bi-star'></i> : At least one object admin of a computer<br /><i class='bi bi-star'></i><i class='bi bi-star'></i><i class='bi bi-star'></i> : Other",
    "poa": "Regularly review and clean up ACL entries for users and groups that no longer require them."
  },
  "has_sid_history": {
    "title": "Objects who can exploit SID History",
    "description": "SID History (Security Identifier History) is a feature that allows a user or group to retain access to resources that they had permissions for in a different domain. This feature is particularly useful in scenarios involving domain migrations, domain trust relationships, or domain reorganizations.",
    "risk": " If an attacker gains control of an account with SID History entries, they may be able to use those historical SIDs to gain unauthorized access to resources in old domains. This is particularly concerning if the attacker can exploit vulnerabilities or weak security practices in the old domain.",
    "poa": "Regularly review and clean up SID History entries for users and groups that no longer require access to resources in old domains."
  },
  "cross_domain_admin_privileges": {
    "title": "Users that have powerful cross-domain privileges",
    "description": "Users privileges are not limited to their domains. Sometimes some users may have direct or non-direct local admin or even domain admin privilege on a foreign domain.",
    "risk": "Cross-domain privileges are quite dangerous and will help attackers to pivot to other domains if they manage to compromise a domain",
    "poa": "Review these privileges, this list should be as little as possible."
  },
  "pre_windows_2000_compatible_access_group": {
    "title": "\"Pre-Windows 2000 Compatible Access\" group",
    "description": "Inadequate object in \"Pre-Windows 2000 Compatible Access\" group.",
    "risk": "Membership of the \"Pre-Windows 2000 Compatible Access\" group allows to enumerate elements of the Active Directory.",
    "poa": "The Pre-Windows 2000 Compatible Access group must contain only \"Authenticated Users\"."
  },
  "guest_accounts": {
    "title": "Guest accounts",
    "description": "List of guest accounts",
    "risk": "The Guest account allows unauthenticated network users to log in as Guest without a password. These unauthorised users can access all resources accessible to the Guest account on the network. This feature means that any shared objects or folders with permissions that allow access to the Guest account, the Domain Guests group, the Guests group, or the Everyone group are accessible on the network, which can lead to data exposure or corruption.",
    "poa": "Guests accounts should be disabled."
  },
  "up_to_date_admincount": {
    "title": "Account status regarding \"adminCount\"",
    "description": "Discrepancies in 'adminCount' attribute for accounts",
    "risk": "Potential security oversight leading to unauthorized access, privilege misrepresentation, or unintended privilege escalation.",
    "poa": "Consistently audit and rectify any discrepancies in the `adminCount` attribute settings for all accounts, ensuring it aligns with actual privilege levels."
  },
  "privileged_accounts_outside_Protected_Users": {
    "title": "Privileged account outside the protected users group.",
    "description": "Privileged accounts not protected by the Protected Users group.",
    "risk": "The Protected Users group should be used to harden authentication and encryption mechanisms for sensitive accounts.",
    "poa": "Privileged accounts must be part of the Protected Users group."
  },
  "azure_users": {
    "title": "Azure users",
    "description": "Exhaustive list of all users in the Azure tenant",
    "risk": "",
    "poa": ""
  },
  "azure_admin": {
    "title": "Azure administrators",
    "description": "List of all administrators in the Azure tenant",
    "risk": "",
    "poa": ""
  },
  "azure_groups": {
    "title": "Azure groups",
    "description": "List of all groups in the Azure tenant",
    "risk": "",
    "poa": ""
  },
  "azure_vm": {
    "title": "Azure virtual machines",
    "description": "List of all virtual machines in the Azure tenant",
    "risk": "",
    "poa": ""
  },
  "azure_users_paths_high_target": {
    "title": "Azure users with a path to high value targets",
    "description": "All Azure users that can compromise a high value target",
    "risk": "Some of these paths could lead to a partial or full compromission of the tenant",
    "poa": "Review and clean up the privileges of these accounts to lower the risk of compromission"
  },
  "azure_ms_graph_controllers": {
    "title": "Direct Controllers of MS Graph",
    "description": "Accounts with privileged access to Microsoft Graph",
    "risk": "Malicious actors can create privileged rights on Microsoft Graph to obtain persistence",
    "poa": "The CISA recommends checking Graph API permissions for threat actors as part of detecting post compromise residual access"
  },
  "azure_aadconnect_users": {
    "title": "Users possibly related to AADConnect",
    "description": "All Users and Azure Users possibly related to AADConnect",
    "risk": "If the list of users linked to AADConnect does not respect the principle of least privilege, this increases the attack surface.",
    "poa": "Review and clean up the liste users related to AADConnect"
  },
  "azure_admin_on_prem": {
    "title": "Admins both on premise and Azure",
    "description": "All accounts that are privileged both on Azure and on premise",
    "risk": "Admin accounts should not be shared between cloud and on premise environments, as it means that the compromission of one leads to the compromission of the other one.",
    "poa": "Review these privileged accounts and opt into differents admin accounts for cloud and on premise environments"
  },
  "azure_roles": {
    "title": "Access to Azure roles",
    "description": "Paths to all builtin and custom Azure roles",
    "risk": "Azure roles usually grant privileges on the tenant, it is therefore important to ensure that all accounts with privileged roles are justified to have so.",
    "poa": "Review all the Azure roles and the users that have them."
  },
  "azure_reset_passwd": {
    "title": "Azure reset password right",
    "description": "Users with the right to reset users' passwords",
    "risk": "These users can change the passwords of other users without knowing their previous password which leads to a control of the account.",
    "poa": "Review the privileged users and ensure they are legitimate."
  },
  "azure_last_passwd_change": {
    "title": "Incoherent last password change",
    "description": "Users whose password change date is different between Azure and on premise",
    "risk": "A difference between the timestamps of the last password change between Azure and on premise environment could mean that a synchronization did not occur and could lead to an exposed account on one of the environment",
    "poa": "Check if the desynchronization is normal."
  },
  "azure_dormant_accounts": {
    "title": "Azure dormant accounts",
    "description": "Users who did not login for 3 months",
    "risk": "An account which has not been used for a long time but is still enabled may be used by attackers as they keep their privilege.",
    "poa": "Dormant accounts should be disabled when confirmed as not used anymore."
  },
  "azure_accounts_disabled_on_prem": {
    "title": "Synced accounts with disabled twin account",
    "description": "Synced Azure accounts with different enabled status as the on premise one",
    "risk": "This anomaly probably means that unused accounts are still enabled on the Azure or on premise environment. An account which has not been used for a long time but is still enabled may be used by attackers as they keep their privilege.",
    "poa": "Ensure that these accounts should still be enabled."
  },
  "azure_accounts_not_found_on_prem": {
    "title": "Accounts synced to non-existing ones",
    "description": "Azure accounts that are synced to an non-existing on premise account",
    "risk": "This anomaly may indicate a misconfiguration in the synchronization of accounts.",
    "poa": "Ensure that this situation is not a symptom of a bigger misconfiguration."
  },
  "azure_cross_ga_da": {
    "title": "Compromission paths between cloud and on premise admins",
    "description": "Paths from Azure admins that leads to on premise admins compromission and vice-versa",
    "risk": "With these paths, a attacker that would have compromised one environment can directly compromise the other one (either cloud or on premise).",
    "poa": "Limit the existence of these paths by limiting the synchronization between administration accounts."
  }
}